package javaArduino;

// Arduino(아두이노) 이탈리아어로
// 이탈리아에서 만든 오픈소스 하드웨어
// 강한친구, 강력한 친구, 절친한 친구

// 아두이노는 컴퓨터가 아니예요. OS설치나 기타 여러가지
// 응용프로그램을 설치할 수 없어요!
// 하지만 라즈베리파이는 OS설치와 응용프그램 설치가 가능.
// 라떼팬더는 싱글보드 컴퓨터예요.. 이놈과 아두이노보드를 연결해서
// 사용을 할 꺼예요.

// 아두이노는 Micro-Controller. 이식된 코드를 수행하는
// 단순한 기계가 아두이노.

// 아두이노가 각광을 받기 시작한 이유는 IoT와 맞물려 있기때문이예요!

// IoT(Internet of Things)사물인터넷
// 일반적인 사물에 통신장비를 결합하고 고도의 통신기술을 이용하여
// 특별한 작업을 수행하는 장비를 지칭!

// 사물인터넷을 구현하기 위해서 그 안에 들어가는 COntroller가
// 가져야 하는 조건..

// 1. 가격이 저렴
// 2. 프로그램 작성과 프로그램 이식이 쉬워야 해요!
// 3. 센서와 액추에이터를 쉽게 사용할 수 있어야 해요

// 아두이노는 브랜드명이예요..그 안에 여러개의 버전이 존재
// 가장 대표적인 모델(버전) => Uno
// 크기가 크지만 꽤나 복잡한 처리를 할 수 있는 버전 => Mega
// 크기가 아주 작은 버전 => Mini
// 굉장히 다양한 버전이 존재하고 우리 목적에 맞게 선택해서 사용

// ========================================

// 전류와 전압
// 전압 => + -> -으로 전류가 흘러요!
// 기억해야 하는 전기상식
// 옴의 법칙
// 전압은 기호로 V(voltage)를 이용하고 단위로는 V(볼트)
// 전류는 기호로 I(Intensity)를 이용하고 단위로는 A(암페어)
// 저항은 기호로 R(Resistance)를 이용하고 단위로는 옴
// 전류 = 전압 / 저항

// 센서는 일반적으로 주위환경에 대한 정보를 수집
// 온도센서, 습도센서, 거리센서, 밝기센서등등을 이용할 수 있어요
// 아두이노가 어떤 활동을 할 수 있도록 도와주는 전자부품이 존재
// 액추에이터 => LED, 모터, 스피커

// 저항은 전기를 열로 바꿔주는 전자부품
// 저항의 값을 알아내는 방법이 존재

// BreadBoard(빵판)
// 여러개의 전자기기를 연결하다보면 헤더소켓이 부족해요!
// 해더소켓을 확장시켜서 사용할 목적으로 이용해요!

// 아두이노를 제어하는 방법에는 디지털방식, 아날로그방식이 존재
// 아두이노 보드에는 헤더소켓이라고 부르는 점퍼와이어를 꼽을 수있는
// 홈이 있어요! => 핀(pin)

// 아두이노 UNO인 경우 DIGITAL이라고 표현된 곳이 있어요!
// 디지털 핀은 총 13개가 존재하는데 0번과 1번은 Serial통신에
// 사용되기 때문에 이 핀은 사용을 지양하는게 좋아요!

// 프로그램 코드를 작성해서 아두이노에 이식을 시켜야 해요!
// 아두이노 IDE를 다운로드 받아서 설치!

// BreadBoard를 이용해서 LED를 제어해 보아요!
// LED => 전압(2V) 전류가 15mA
// 전압 = 전류 * 저항
// 5-2(3) = 0.015 * 200

//버튼을 눌렀을 때 불이 켜지게 하고 싶어요!!

public class ArduinoTest {

}








